jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
    init.evt_handler = ble_nus_c_evt_handler;
    init.error_handler = nus_error_handler;
    init.p_gatt_queue = &m_ble_gatt_queue;

    /* CHANGES
    err_code = ble_nus_c_init(&m_ble_nus_c, &init);
    APP_ERROR_CHECK(err_code);
	END CHANGES */
    for (int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
    {
        err_code = ble_nus_c_init(&m_ble_nus_c[c], &init);
        APP_ERROR_CHECK(err_code);
    }
    /* END CHANGES */
}















//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// IMU SERVICE
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

BLE_IMU_SERVICE_C_ARRAY_DEF(m_imu_service_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT); /**< Structure used to identify the battery service. */


static void queue_process_packet(received_data_t * data, uint32_t * len)
{
    ret_code_t err_code;

    // Put the received data in FIFO buffer
    err_code = app_fifo_write(&buffer.received_data_fifo, (uint8_t *) data, len);

    // NRF_LOG_INFO("Fifo PUT: %d", usr_get_fifo_len(&buffer.received_data_fifo))

    if (err_code == NRF_ERROR_NO_MEM)
    {
        NRF_LOG_INFO("RECEIVED DATA FIFO BUFFER FULL!");
    }
    if (err_code == NRF_SUCCESS)
    {
        schedule(imu_uart_sceduled); // TODO CHECK
    }
    APP_ERROR_CHECK(err_code);
}

void print_packet_count(ble_imu_service_c_evt_t *p_evt)
{
    // Print out the packet count from each of the slaves
    if (p_evt->conn_handle == 0)
    {
        imu.received_packet_counter1++;
        NRF_LOG_INFO("received_packet_counter1 %d", imu.received_packet_counter1);
    }
    else if (p_evt->conn_handle == 1)
    {
        imu.received_packet_counter2++;
        NRF_LOG_INFO("received_packet_counter2 %d", imu.received_packet_counter2);
    }
    else if (p_evt->conn_handle == 2)
    {
        imu.received_packet_counter3++;
        NRF_LOG_INFO("received_packet_counter3 %d", imu.received_packet_counter3);
    }
    else if (p_evt->conn_handle == 3)
    {
        imu.received_packet_counter4++;
        NRF_LOG_INFO("received_packet_counter4 %d", imu.received_packet_counter4);
    }
}


void imu_service_c_evt_handler(ble_imu_service_c_t *p_ble_imu_service_c, ble_imu_service_c_evt_t *p_evt)
{

    // nrf_gpio_pin_set(11);

    // Print packet count for each connected device
    // print_packet_count(p_evt);

    // NRF_LOG_INFO("imu_service_c_evt_handler: %d", p_evt->evt_type);

    switch (p_evt->evt_type)
    {
        ret_code_t err_code;

    case BLE_IMU_SERVICE_C_EVT_DISCOVERY_COMPLETE:
    {

        NRF_LOG_INFO("imu_service_c_evt_handler: conn_handle: %d", p_evt->conn_handle);

        // Assign connection handles
        // usr_ble_handles_assign(p_ble_imu_service_c, p_evt);

        ret_code_t err_code;

        err_code = ble_imu_service_c_handles_assign(p_ble_imu_service_c,
                                        p_evt->conn_handle,
                                        &p_evt->params.peer_db);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_INFO("IMU assigned conn_handle: %d - %d, %d", p_ble_imu_service_c->conn_handle, m_imu_service_c[0].conn_handle, m_imu_service_c[1].conn_handle);

        // Enable notifications - in peripheral this equates to turning on the sensors
        usr_enable_notif(p_ble_imu_service_c, p_evt);

        NRF_LOG_FLUSH();
    }
    break;

    case BLE_IMU_SERVICE_EVT_QUAT:
    {

        #ifdef USE_INTERNAL_COMM

        NRF_LOG_INFO("QUAT received");

        // Build packet
        ble_imu_service_c_evt_type_t type = BLE_IMU_SERVICE_EVT_QUAT;
        comm_process(type, p_evt);

        NRF_LOG_INFO("QUAT processed");

        #else

        for (uint8_t i = 0; i < BLE_PACKET_BUFFER_COUNT; i++)
        {
            received_data_t received_quat;
            uint32_t received_quat_len = sizeof(received_quat);

            // Initialize struct to all zeros
            memset(&received_quat, 0, received_quat_len);

            received_quat.conn_handle = p_evt->conn_handle;
            received_quat.quat_data_present = 1;

            #define FIXED_POINT_FRACTIONAL_BITS_QUAT 30

            received_quat.quat_data.w = ((float)p_evt->params.value.quat_data.quat[i].w / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            received_quat.quat_data.x = ((float)p_evt->params.value.quat_data.quat[i].x / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            received_quat.quat_data.y = ((float)p_evt->params.value.quat_data.quat[i].y / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            received_quat.quat_data.z = ((float)p_evt->params.value.quat_data.quat[i].z / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));

            NRF_LOG_INFO("quat: %d %d  %d  %d", (int)(received_quat.quat_data.w*1000), (int)(received_quat.quat_data.x*1000), (int)(received_quat.quat_data.y*1000), (int)(received_quat.quat_data.z*1000));

            // Put data into FIFO buffer and let event handler know to process the packet
            queue_process_packet(&received_quat, &received_quat_len);
        }
        #endif

    }
    break;

    case BLE_IMU_SERVICE_EVT_EULER:
    {
        float euler_buff[3];
        uint32_t euler_buff_len = sizeof(euler_buff);

        #define FIXED_POINT_FRACTIONAL_BITS_EULER 16

        euler_buff[0] = ((float)p_evt->params.value.euler_data.yaw / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));
        euler_buff[1] = ((float)p_evt->params.value.euler_data.pitch / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));
        euler_buff[2] = ((float)p_evt->params.value.euler_data.roll / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));

        NRF_LOG_INFO("euler: %d %d  %d", (int)euler_buff[0], (int)euler_buff[1], (int)euler_buff[2]);
    
    }
    break;

    case BLE_IMU_SERVICE_EVT_RAW:
    {

        for (uint8_t i = 0; i < BLE_PACKET_BUFFER_COUNT; i++)
        {

    #define RAW_Q_FORMAT_GYR_COMMA_BITS 5  // Number of bits used for comma part of raw data.
    #define RAW_Q_FORMAT_ACC_COMMA_BITS 10 // Number of bits used for comma part of raw data.
    #define RAW_Q_FORMAT_CMP_COMMA_BITS 4  // Number of bits used for comma part of raw data.

            received_data_t received_raw;
            uint32_t received_raw_len = sizeof(received_raw);

            // Initialize struct to all zeros
            memset(&received_raw, 0, received_raw_len);

            received_raw.conn_handle = p_evt->conn_handle;
            received_raw.raw_data_present = 1;
            received_raw.raw_data.gryo.x = ((float)p_evt->params.value.raw_data.single_raw[i].gyro.x / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
            received_raw.raw_data.gryo.y = ((float)p_evt->params.value.raw_data.single_raw[i].gyro.y / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
            received_raw.raw_data.gryo.z = ((float)p_evt->params.value.raw_data.single_raw[i].gyro.z / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));

            received_raw.raw_data.accel.x = ((float)p_evt->params.value.raw_data.single_raw[i].accel.x / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
            received_raw.raw_data.accel.y = ((float)p_evt->params.value.raw_data.single_raw[i].accel.y / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
            received_raw.raw_data.accel.z = ((float)p_evt->params.value.raw_data.single_raw[i].accel.z / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));

            received_raw.raw_data.mag.x = ((float)p_evt->params.value.raw_data.single_raw[i].compass.x / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));
            received_raw.raw_data.mag.y = ((float)p_evt->params.value.raw_data.single_raw[i].compass.y / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));
            received_raw.raw_data.mag.z = ((float)p_evt->params.value.raw_data.single_raw[i].compass.z / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));

            // Put data into FIFO buffer and let event handler know to process the packet
            queue_process_packet(&received_raw, &received_raw_len);

            // NRF_LOG_INFO("raw:  gyro: %d %d  %d", (int)(received_raw.raw_data.gryo.x*1000), (int)(received_raw.raw_data.gryo.y*1000), (int)(received_raw.raw_data.gryo.z*1000));
            // NRF_LOG_INFO("raw:  accel: %d   %d  %d", (int)(accel[0]*1000), (int)(accel[1]*1000), (int)(accel[2]*1000));
            // NRF_LOG_INFO("raw:  mag: %d %d  %d", (int)(mag[0]*1000), (int)(mag[1]*1000), (int)(mag[2]*1000));

            // NRF_LOG_INFO("raw:  gyro: %d %d  %d", (int)(gyro[0]*1000), (int)(gyro[1]*1000), (int)(gyro[2]*1000));
            // NRF_LOG_INFO("raw:  accel: %d   %d  %d", (int)(accel[0]*1000), (int)(accel[1]*1000), (int)(accel[2]*1000));
            // NRF_LOG_INFO("raw:  mag: %d %d  %d", (int)(mag[0]*1000), (int)(mag[1]*1000), (int)(mag[2]*1000));
        }
    }
    break;

    case BLE_IMU_SERVICE_EVT_ADC:
    {
        // NRF_LOG_INFO("ADC data: %d", p_evt->params.value.adc_data.raw[1]);

        // received_data_t received_adc;
        // uint32_t received_adc_len = sizeof(received_adc);

        // // Initialize struct to all zeros
        // memset(&received_adc, 0, received_adc_len);

        // received_adc.conn_handle = p_evt->conn_handle;
        // received_adc.adc_data_present = 1;

        // // TODO copy all data to print buffers
        // received_adc.adc_data.raw[0] = p_evt->params.value.adc_data.raw[0];

        // // Put data into FIFO buffer and let event handler know to process the packet
        // queue_process_packet(&received_adc, &received_adc_len);
    }
    break;

    default:
    {
        NRF_LOG_INFO("imu_service_c_evt_handler DEFAULT: %d", (p_evt->evt_type));
    }
    break;
    }

    // nrf_gpio_pin_clear(11);
}

void imu_service_c_init()
{
    ret_code_t err_code;

    ble_imu_service_c_init_t imu_service_c_init_obj;
    imu_service_c_init_obj.evt_handler = imu_service_c_evt_handler;
    imu_service_c_init_obj.p_gatt_queue = &m_ble_gatt_queue;

