jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_imu_service_c_init(&m_imu_service_c[i], &imu_service_c_init_obj);
        APP_ERROR_CHECK(err_code);
    }
}

void usr_ble_handles_assign(ble_imu_service_c_t *p_ble_imu_service_c, ble_imu_service_c_evt_t *p_evt)
{
    ret_code_t err_code;

    err_code = ble_imu_service_c_handles_assign(p_ble_imu_service_c,
                                        p_evt->conn_handle,
                                        &p_evt->params.peer_db);

    
    NRF_LOG_INFO("Thingy Environment service discovered on conn_handle 0x%x.", p_evt->conn_handle);
}

void usr_enable_notif(ble_imu_service_c_t *p_ble_imu_service_c, ble_imu_service_c_evt_t *p_evt)
{
    ret_code_t err_code;

    // Enable notifications - in peripheral this equates to turning on the sensors
    err_code = ble_imu_service_c_quaternion_notif_enable(&m_imu_service_c[p_evt->conn_handle]);
    APP_ERROR_CHECK(err_code);
    err_code = ble_imu_service_c_adc_notif_enable(&m_imu_service_c[p_evt->conn_handle]);
    APP_ERROR_CHECK(err_code);
    err_code = ble_imu_service_c_euler_notif_enable(&m_imu_service_c[p_evt->conn_handle]);
    APP_ERROR_CHECK(err_code);
    err_code = ble_imu_service_c_raw_notif_enable(&m_imu_service_c[p_evt->conn_handle]);
    APP_ERROR_CHECK(err_code);
}

void usr_ble_config_send(ble_imu_service_config_t config)
{
    ret_code_t err_code;

    //You can iterate through the list of connection handles:
    for (uint8_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {

        // TODO: Make list of connected handles instead of sending it to all of the 8 handles
        // This could prevent torubles in the future

        NRF_LOG_INFO("IMU conn_handle: %d", m_imu_service_c[i].conn_handle);

        err_code = ble_imu_service_config_set(&m_imu_service_c[i], &config);

        if(err_code != NRF_ERROR_INVALID_STATE && err_code != NRF_SUCCESS) 
        {
            APP_ERROR_CHECK(err_code);
        }
        
        NRF_LOG_FLUSH();

    }
}


ret_code_t imu_disconnect(uint32_t conn_handle_num)
{
    ret_code_t err_code;

    // Disconnect IMU's
    err_code = sd_ble_gap_disconnect(conn_handle_num, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if(err_code == BLE_ERROR_INVALID_CONN_HANDLE)
    {
        NRF_LOG_INFO("BLE_ERROR_INVALID_CONN_HANDLE");
    }
    
    if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != BLE_ERROR_INVALID_CONN_HANDLE) )
    {
        APP_ERROR_CHECK(err_code);
    }
    NRF_LOG_INFO("IMU Disconnected");

    return err_code;
}


void set_config_sync_enable(bool enable)
{
    imu.sync_enabled = enable;
}

void set_config_adc_enable(bool enable)
{
    imu.adc = enable;
}

void set_config_gyro_enable(bool enable)
{
    imu.gyro_enabled = enable;
}

void set_config_accel_enable(bool enable)
{
    imu.accel_enabled = enable;
}

void set_config_mag_enable(bool enable)
{
    imu.mag_enabled = enable;
}

void set_config_quat6_enable(bool enable)
{
    imu.quat6_enabled = enable;
}

void set_config_quat9_enable(bool enable)
{
    imu.quat9_enabled = enable;
}

void set_config_euler_enable(bool enable)
{
    imu.euler_enabled = enable;
}

void set_config_wom_enable(bool enable)
{
    imu.wom = enable;
}

void set_config_frequency(uint32_t freq)
{
    imu.frequency = freq;
}

void set_config_reset()
{
    imu.gyro_enabled = 0;
    imu.accel_enabled = 0;
    imu.mag_enabled = 0;
    imu.quat6_enabled = 0;
    imu.quat9_enabled = 0;
    imu.euler_enabled = 0;
    imu.frequency = 0;
    imu.sync_enabled = 0;
    imu.stop = 0;
    imu.adc = 0;
    imu.wom = 0;
}

void config_send()
{
    ret_code_t err_code;

    ble_imu_service_config_t config;
    config.gyro_enabled = imu.gyro_enabled;
    config.accel_enabled = imu.accel_enabled;
    config.mag_enabled = imu.mag_enabled;
    config.euler_enabled = imu.euler_enabled;
    config.quat6_enabled = imu.quat6_enabled;
    config.quat9_enabled = imu.quat9_enabled;
    config.motion_freq_hz = imu.frequency;
    config.wom_enabled = imu.wom;
    config.sync_enabled = imu.sync_enabled;
    config.stop = imu.stop;
    config.adc_enabled = imu.adc;

    // Get timestamp from master
    imu.sync_start_time = usr_ts_timestamp_get_ticks_u64();

    // Send start signal to be 2 seconds later
    imu.sync_start_time = ( USR_TIME_SYNC_TIMESTAMP_TO_USEC(imu.sync_start_time) / 1000 ) + 2000;

    imu.sync_start_time = ( USR_TIME_SYNC_MSEC_TO_TICK(imu.sync_start_time) / 100 ) * 100;


    config.sync_start_time = imu.sync_start_time;
 
    // Send config to peripheral
    usr_ble_config_send(config);
}



void schedule(app_sched_event_handler_t handler)
{
    ret_code_t err_code;

    // Signal to event handler to execute sprintf + start UART transmission
    // If there are already events in the queue
    if (imu.evt_scheduled > 0)
    {
        imu.evt_scheduled++;
    }
    // If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
    else
    {
        imu.evt_scheduled++;
        err_code = app_sched_event_put(0, 0, imu_uart_sceduled);
        APP_ERROR_CHECK(err_code);
    }
}


void imu_uart_sceduled(void *p_event_data, uint16_t event_size)
{
    while (imu.evt_scheduled > 0)
    {
        ret_code_t err_code;

        bool read_success = false;

        // NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);

        char string[1024];

        received_data_t temp;
        uint32_t temp_len = sizeof(temp);

        float quat[4];
        uint32_t quat_len = sizeof(quat);

        if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)&temp, &temp_len) == NRF_SUCCESS)
        {

            // NRF_LOG_INFO("Fifo GET: %d", usr_get_fifo_len(&buffer.received_data_fifo))

            // sprintf(string, "%d w%.3fwa%.3fab%.3fbc%.3fc\n", device_nr[0], quat[0], quat[1], quat[2], quat[3]);

            // If packet contains QUATERNIONS
            if (temp.quat_data_present)
            {
                // sprintf(string, "%d Q   %.3f    %.3f    %.3f    %.3f\n", temp.conn_handle, temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
                sprintf(string, "w%.3fwa%.3fab%.3fbc%.3fc\n", temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
            }
            else
                // if packet contains RAW DATA
                if (temp.raw_data_present)
            {
                sprintf(string, "%d G %.3f %.3f %.3f        A %.3f %.3f %.3f        M %.3f %.3f %.3f\n", temp.conn_handle, temp.raw_data.gryo.x, temp.raw_data.gryo.y, temp.raw_data.gryo.z, temp.raw_data.accel.x, temp.raw_data.accel.y, temp.raw_data.accel.z, temp.raw_data.mag.x, temp.raw_data.mag.y, temp.raw_data.mag.z);
            }
            // else
                // If packet contains ADC DATA
            //     if (temp.adc_data_present)
            // {
            //     sprintf(string, "%d ADC %.3f\n", temp.conn_handle, temp.adc_data.raw[0]);
            //     NRF_LOG_INFO("To be implemented.");
            // }

            read_success = true;
            imu.evt_scheduled--;
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {
            uint32_t string_len = calculate_string_len(string);

