jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
            // Send data over UART
            uart_queued_tx((uint8_t *)string, &string_len);
        }
    }
}














//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// BATTERY SERVICE
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// Battery serice receiver
BLE_BAS_C_ARRAY_DEF(m_bas_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT);     /**< Structure used to identify the Battery Service client module. */


/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void bas_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Battery level Collector Handler.
 */
static void bas_c_evt_handler(ble_bas_c_t * p_bas_c, ble_bas_c_evt_t * p_bas_c_evt)
{
    ret_code_t err_code;

    NRF_LOG_INFO("bas_c_evt_handler: %d", p_bas_c_evt->evt_type);

    switch (p_bas_c_evt->evt_type)
    {
        case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
        {
            err_code = ble_bas_c_handles_assign(p_bas_c,
                                                p_bas_c_evt->conn_handle,
                                                &p_bas_c_evt->params.bas_db);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("BAS assigned conn_handle: %d - %d, %d", p_bas_c_evt->conn_handle, m_bas_c[0].conn_handle, m_bas_c[1].conn_handle);

            // Battery service discovered. Enable notification of Battery Level.
            NRF_LOG_DEBUG("Battery Service discovered. Reading battery level.");

            err_code = ble_bas_c_bl_read(p_bas_c);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_DEBUG("Enabling Battery Level Notification.");
            err_code = ble_bas_c_bl_notif_enable(p_bas_c);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_FLUSH();

        } break;

        case BLE_BAS_C_EVT_BATT_NOTIFICATION:
        case BLE_BAS_C_EVT_BATT_READ_RESP:
            NRF_LOG_INFO("Battery Level received %d %%.", p_bas_c_evt->params.battery_level);

            // Calculate and store battery voltage level in buffer
            batt_array.batt[p_bas_c_evt->conn_handle].voltage = usr_map_adc_to_uint8(p_bas_c_evt->params.battery_level);
            NRF_LOG_INFO("Voltage (conn handle %d) -> " NRF_LOG_FLOAT_MARKER "", p_bas_c_evt->conn_handle, NRF_LOG_FLOAT(batt_array.batt[p_bas_c_evt->conn_handle].voltage));

            // Calculate and store battery percentage level in buffer
            batt_array.batt[p_bas_c_evt->conn_handle].level =  usr_adc_voltage_to_percent(batt_array.batt[p_bas_c_evt->conn_handle].voltage);
            NRF_LOG_INFO("Percentage (conn handle %d) -> %d", p_bas_c_evt->conn_handle, batt_array.batt[p_bas_c_evt->conn_handle].level);

            break;

        default:
            break;
    }
}

/**
 * @brief Battery level collector initialization.
 */
static void bas_c_init(void)
{
    ret_code_t err_code;

    ble_bas_c_init_t bas_c_init_obj;

    bas_c_init_obj.evt_handler   = bas_c_evt_handler;
    bas_c_init_obj.error_handler = bas_error_handler;
    bas_c_init_obj.p_gatt_queue  = &m_ble_gatt_queue;


    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_bas_c_init(&m_bas_c[i], &bas_c_init_obj);
        APP_ERROR_CHECK(err_code);
    }
}

void usr_batt_print_conn_handle()
{
        uart_print("------------------------------------------\n");

        ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

        for (uint32_t i = 0; i < conn_central_handles.len; i++)
        {
            uint16_t conn_handle = conn_central_handles.conn_handles[i];

            // Print Connected Devices
            uint8_t str[100];
            sprintf(str, "Battery level: (conn handle %d)   %0.2f   ( +- %d procent )\n", conn_handle, batt_array.batt[conn_handle].voltage, batt_array.batt[conn_handle].level);
            uart_print(str);
        }
        uart_print("------------------------------------------\n");  
}




//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// BLE COMMON
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t *p_evt)
{
    /* CHANGES */
    //ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
    ble_nus_c_on_db_disc_evt(&m_ble_nus_c[p_evt->conn_handle], p_evt);
    /* END CHANGES */

    // Add discovery for IMU_SERVICE service
    ble_imu_service_on_db_disc_evt(&m_imu_service_c[p_evt->conn_handle], p_evt);

    // Add discovery for Battery service
    ble_bas_on_db_disc_evt(&m_bas_c[p_evt->conn_handle], p_evt);
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ret_code_t err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
    case BLE_GAP_EVT_ADV_REPORT:
        {
        // Initialize advertisement report for parsing.
        // NRF_LOG_INFO("Peer_addr %d", p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr);
        // NRF_LOG_INFO("Handle %d",p_ble_evt->evt.gap_evt.params.scan_req_report.adv_handle);

