jonacappelle/nRF52-DCU/BLE_Services/usr_ble.c
    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Set filter based on name
    for (int i=0; i< NRF_BLE_SCAN_NAME_CNT; i++){
        err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name[i]);
        APP_ERROR_CHECK(err_code);
    }

    // Only enable name filter
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, true);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
    NRF_LOG_INFO("BLE gatt evt handler");

    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        NRF_LOG_INFO("ATT MTU exchange completed.");

        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Ble NUS max data length set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
}

/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the database discovery module. */
void db_discovery_init(void)
{
    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(ble_db_discovery_init_t));

    db_init.evt_handler = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);
    APP_ERROR_CHECK(err_code);
}

char const *phy_str(ble_gap_phys_t phys)
{
    static char const *str[] =
        {
            "1 Mbps",
            "2 Mbps",
            "Coded",
            "Unknown"};

    switch (phys.tx_phys)
    {
    case BLE_GAP_PHY_1MBPS:
        return str[0];

    case BLE_GAP_PHY_2MBPS:
    case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS:
    case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED:
        return str[1];

    case BLE_GAP_PHY_CODED:
        return str[2];

    default:
        return str[3];
    }
}



void conn_evt_len_ext_set(void)
{
    ret_code_t err_code;
    ble_opt_t opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = 1;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}

void services_init()
{
    // BLE NUS Service
    nus_c_init();

    // Motion Service
    imu_service_c_init();

    // Battery Service
    bas_c_init();

    // Init DFU service
    // ble_dfu_init(); // This is not necessary if the DFU is performed via button
}



void usr_ble_disconnect()
{
    ret_code_t err_code;

    for (int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
    {
        err_code = sd_ble_gap_disconnect(m_ble_nus_c[c].conn_handle,
                                            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }    
}







//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// OTHER
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


void received_data_buffers_init()
{
    ret_code_t err_code;

    // // Initialize FIFO structure for collecting received data
    err_code = app_fifo_init(&buffer.received_data_fifo, buffer.received_data_buffer, (uint16_t)sizeof(buffer.received_data_buffer));
    APP_ERROR_CHECK(err_code);
}

uint32_t usr_ble_get_conn_handle_len()
{
    ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

    return conn_central_handles.len;
}

void usr_ble_print_connection_handles()
{
    ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();

    //You can iterate through the list of connection handles:
    for (uint32_t i = 0; i < conn_central_handles.len; i++)
    {
        uint16_t conn_handle = conn_central_handles.conn_handles[i];

        // Print Connected Devices
        uint8_t str[100];
        sprintf(str, "Sensor    %d  --> conn handle  %d\n", (i + 1), conn_handle);
        uart_print(str);
    }
}

void usr_ble_print_settings()
{
    uart_print("------------------------------------------\n");
    uart_print("Current settings:\n");
    if (imu.gyro_enabled)
        uart_print("---    Gyroscope enabled\n");
    if (imu.accel_enabled)
        uart_print("---   Accelerometer enabled\n");
    if (imu.mag_enabled)
        uart_print("--- Magnetometer enabled\n");
    if (imu.euler_enabled)
        uart_print("---   Euler angles enabled\n");
    if (imu.quat6_enabled)
        uart_print("---   Quaternions 6 DoF enabled\n");
    if (imu.quat9_enabled)
        uart_print("---   Quaternions 9 DoF enabled\n");
    if (imu.frequency != 0)
    {
        uart_print("---  Sensor frequency:  ");
        char str[5];
        sprintf(str, "%d Hz\n", imu.frequency);
        NRF_LOG_INFO("string: %s", str);
        uart_print(str);
    }
    if (imu.adc)
        uart_print("---   ADC enabled\n");
    if (imu.sync_enabled)
        uart_print("---   Synchonization enabled\n");
    if (imu.wom)
        uart_print("---   WoM enabled\n");
    uart_print("------------------------------------------\n");
}

